app/controllers/attachments_controller.rb

    def set_attachment
      @attachment = Attachment.find(params[:id])
---
SELECT  "attachments".* FROM "attachments" WHERE "attachments"."id" = $1 LIMIT 1  [["id", 3]]