app/controllers/attractions_controller.rb

    def set_attraction
      @attraction = Attraction.find(params[:id])
---
SELECT  "attractions".* FROM "attractions" WHERE "attractions"."id" = $1 LIMIT 1  [["id", 1]]