app/controllers/countries_controller.rb

  def index
    @countries = Country.all
---
SELECT "countries".* FROM "countries"