app/controllers/reviews_controller.rb

    def set_review
      @review = Review.find(params[:id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT 1  [["id", 1]]