app/controllers/tourist_attractions_controller.rb

  def index
    @tourist_attractions = TouristAttraction.all
---
SELECT "tourist_attractions".* FROM "tourist_attractions"

    def set_tourist_attraction
      @tourist_attraction = TouristAttraction.find(params[:id])
---
SELECT  "tourist_attractions".* FROM "tourist_attractions" WHERE "tourist_attractions"."id" = $1 LIMIT 1  [["id", 1]]