app/controllers/tourist_attraction_details_controller.rb

    def set_tourist_attraction_detail
      @tourist_attraction_detail = TouristAttractionDetail.find(params[:id])
---
SELECT  "tourist_attraction_details".* FROM "tourist_attraction_details" WHERE "tourist_attraction_details"."id" = $1 LIMIT 1  [["id", 1]]