app/controllers/tours_controller.rb

SELECT "tours".* FROM "tours" WHERE "tours"."price" = $1 AND "tours"."city_id" = 1  [["price", 10.0]]
---
  def index
    @tours = Tour.search(params['price'], params['city'], params['country'])

SELECT  "tours".* FROM "tours" WHERE "tours"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_tour
      @tour = Tour.find(params[:id])